In [1]:
import pandas as pd
import numpy as np

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[ 0.01714738, -0.39989343, -0.03829286],
       [ 0.94529364, -0.65451448,  0.03215901],
       [-0.13279783,  1.27225237,  0.51229394],
       [-0.02510762, -0.64047959, -1.90600246]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0  0.017147 -0.399893 -0.038293
1  0.945294 -0.654514  0.032159
2 -0.132798  1.272252  0.512294
3 -0.025108 -0.640480 -1.906002

In [8]:
type(dataFrame[0])

pandas.core.series.Series

In [9]:
yenidf = pd.DataFrame(data, index = ["Atil","Zeynep","Atlas","Mehmet"],columns=["maas","yas","calismaSaati"])

In [10]:
yenidf

            maas       yas  calismaSaati
Atil    0.017147 -0.399893     -0.038293
Zeynep  0.945294 -0.654514      0.032159
Atlas  -0.132798  1.272252      0.512294
Mehmet -0.025108 -0.640480     -1.906002

In [11]:
yenidf["yas"]

Atil     -0.399893
Zeynep   -0.654514
Atlas     1.272252
Mehmet   -0.640480
Name: yas, dtype: float64

In [12]:
yenidf["calismaSaati"]

Atil     -0.038293
Zeynep    0.032159
Atlas     0.512294
Mehmet   -1.906002
Name: calismaSaati, dtype: float64

In [13]:
yenidf[["yas","maas"]]

             yas      maas
Atil   -0.399893  0.017147
Zeynep -0.654514  0.945294
Atlas   1.272252 -0.132798
Mehmet -0.640480 -0.025108

In [14]:
yenidf.loc["Atil"] # location

maas            0.017147
yas            -0.399893
calismaSaati   -0.038293
Name: Atil, dtype: float64

In [16]:
yenidf.iloc[1] #index bazlı locate

maas            0.945294
yas            -0.654514
calismaSaati    0.032159
Name: Zeynep, dtype: float64

In [17]:
yenidf["emeklilikyasi"]=yenidf["yas"]+yenidf["yas"]

In [18]:
yenidf

            maas       yas  calismaSaati  emeklilikyasi
Atil    0.017147 -0.399893     -0.038293      -0.799787
Zeynep  0.945294 -0.654514      0.032159      -1.309029
Atlas  -0.132798  1.272252      0.512294       2.544505
Mehmet -0.025108 -0.640480     -1.906002      -1.280959

In [20]:
yenidf.drop("emeklilikyasi",axis = 1) #axis 1 --> column #default değer => axis = 0

            maas       yas  calismaSaati
Atil    0.017147 -0.399893     -0.038293
Zeynep  0.945294 -0.654514      0.032159
Atlas  -0.132798  1.272252      0.512294
Mehmet -0.025108 -0.640480     -1.906002

In [21]:
yenidf.drop("emeklilikyasi",axis=1,inplace=True)

In [22]:
yenidf

            maas       yas  calismaSaati
Atil    0.017147 -0.399893     -0.038293
Zeynep  0.945294 -0.654514      0.032159
Atlas  -0.132798  1.272252      0.512294
Mehmet -0.025108 -0.640480     -1.906002

In [23]:
yenidf.loc["Atil"]["yas"]

-0.3998934343692565

In [24]:
yenidf.loc["Atil","yas"]

-0.3998934343692565

In [25]:
yenidf[yenidf["calismaSaati"]>0]

            maas       yas  calismaSaati
Zeynep  0.945294 -0.654514      0.032159
Atlas  -0.132798  1.272252      0.512294

## index değiştirme

In [29]:
yenidf.reset_index(inplace=True) #resetleri indexleme

In [30]:
yenidf

    index      maas       yas  calismaSaati
0    Atil  0.017147 -0.399893     -0.038293
1  Zeynep  0.945294 -0.654514      0.032159
2   Atlas -0.132798  1.272252      0.512294
3  Mehmet -0.025108 -0.640480     -1.906002

In [31]:
yeniIndexList = ["Ati","Zey","Atl","Meh"]

In [32]:
yenidf["yeni Indeks"] = yeniIndexList

In [33]:
yenidf

    index      maas       yas  calismaSaati yeni Indeks
0    Atil  0.017147 -0.399893     -0.038293         Ati
1  Zeynep  0.945294 -0.654514      0.032159         Zey
2   Atlas -0.132798  1.272252      0.512294         Atl
3  Mehmet -0.025108 -0.640480     -1.906002         Meh

In [37]:
yenidf.set_index("yeni Indeks",inplace = True)

In [38]:
yenidf

              index      maas       yas  calismaSaati
yeni Indeks
Ati            Atil  0.017147 -0.399893     -0.038293
Zey          Zeynep  0.945294 -0.654514      0.032159
Atl           Atlas -0.132798  1.272252      0.512294
Meh          Mehmet -0.025108 -0.640480     -1.906002

In [39]:
ilkIndeks = ["simpson","simpson","simpson","southpark","southpark","southpark"]

In [40]:
icindeks = ["homer","bart","marge","cartman","kenny","kyle"]

In [43]:
birlesmisIndex = list(zip(ilkIndeks,icindeks))

In [48]:
birlesmisIndex

MultiIndex([(  'simpson',   'homer'),
            (  'simpson',    'bart'),
            (  'simpson',   'marge'),
            ('southpark', 'cartman'),
            ('southpark',   'kenny'),
            ('southpark',    'kyle')],
           )

In [45]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [49]:
benimCizgiList = [[40,"a"],[10,"b"],[20,"c"],[30,"D"],[50,"E"], [60,"K"]]

In [50]:
benimCizgiList

[[40, 'a'], [10, 'b'], [20, 'c'], [30, 'D'], [50, 'E'], [60, 'K']]

In [51]:
cizgiFilmDizi = np.array(benimCizgiList)

In [54]:
cizgidf = pd.DataFrame(cizgiFilmDizi,index=birlesmisIndex,columns=["yas","meslek"])

In [55]:
cizgidf

                  yas meslek
simpson   homer    40      a
          bart     10      b
          marge    20      c
southpark cartman  30      D
          kenny    50      E
          kyle     60      K

In [56]:
cizgidf.loc["simpson"]

      yas meslek
homer  40      a
bart   10      b
marge  20      c

In [58]:
cizgidf.loc["southpark"].loc["kenny"]

yas       50
meslek     E
Name: kenny, dtype: object

In [59]:
cizgidf.index.names = ["filmadı","isim"]

In [60]:
cizgidf

                  yas meslek
filmadı   isim
simpson   homer    40      a
          bart     10      b
          marge    20      c
southpark cartman  30      D
          kenny    50      E
          kyle     60      K

In [61]:
 sozlukVeri = {"istanbul" : [30,29,np.nan], "ankara ": [20,np.nan,25], "izmir":[40,39,38]}
havadurumu = pd.DataFrame(sozlukVeri)

In [62]:
havadurumu

   istanbul  ankara   izmir
0      30.0     20.0     40
1      29.0      NaN     39
2       NaN     25.0     38

In [63]:
havadurumu.dropna() #nan olan satırları direkt çıkartır

   istanbul  ankara   izmir
0      30.0     20.0     40

In [64]:
havadurumu.dropna(axis = 1)

   izmir
0     40
1     39
2     38

In [65]:
sozlukVeri = {"istanbul" : [30,np.nan,np.nan], "ankara ": [20,np.nan,25], "izmir":[40,39,38],"antalya":[45,np.nan,np.nan]}
havadurumu = pd.DataFrame(sozlukVeri)

In [66]:
havadurumu

   istanbul  ankara   izmir  antalya
0      30.0     20.0     40     45.0
1       NaN      NaN     39      NaN
2       NaN     25.0     38      NaN

In [68]:
havadurumu.dropna(axis = 1, thresh = 2)

   ankara   izmir
0     20.0     40
1      NaN     39
2     25.0     38

In [69]:
havadurumu.fillna(20)

   istanbul  ankara   izmir  antalya
0      30.0     20.0     40     45.0
1      20.0     20.0     39     20.0
2      20.0     25.0     38     20.0

In [74]:
maasSoazlugu = {"departman":["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
                "çalışan ismi": ["atıl","ahmet","mehmet","burak","zeynep","fatma"],
                "maas":[100,200,150,300,400,500]
               }

In [75]:
maasdf = pd.DataFrame(maasSoazlugu)

In [76]:
maasdf

   departman çalışan ismi  maas
0    yazılım         atıl   100
1    yazılım        ahmet   200
2  pazarlama       mehmet   150
3  pazarlama        burak   300
4      hukuk       zeynep   400
5      hukuk        fatma   500

In [78]:
maasdf = maasdf.groupby("departman")

In [79]:
maasdf.count()

           çalışan ismi  maas
departman
hukuk                 2     2
pazarlama             2     2
yazılım               2     2

In [80]:
maasdf.mean()

           maas
departman
hukuk       450
pazarlama   225
yazılım     150

In [81]:
maasdf.max()

          çalışan ismi  maas
departman
hukuk           zeynep   500
pazarlama       mehmet   300
yazılım           atıl   200

In [82]:
maasdf.describe()

           maas
          count   mean         std    min    25%    50%    75%    max
departman
hukuk       2.0  450.0   70.710678  400.0  425.0  450.0  475.0  500.0
pazarlama   2.0  225.0  106.066017  150.0  187.5  225.0  262.5  300.0
yazılım     2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0

## concat

In [89]:
sozluk = {"isim":["ahmet","mehmet","zeynep","atıl"],
         "spor" :["koşu","yüzme","koşu","basket"],
         "kalori":[100,200,300,400]}

In [90]:
df = pd.DataFrame(sozluk)

In [91]:
df

     isim    spor  kalori
0   ahmet    koşu     100
1  mehmet   yüzme     200
2  zeynep    koşu     300
3    atıl  basket     400

In [92]:
sozluk2 = {"isim":["osman","levent","atlas","fatma"],
         "spor" :["koşu","yüzme","koşu","basket"],
         "kalori":[300,200,250,400]}

In [95]:
df_2 = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [96]:
df_2

     isim    spor  kalori
4   osman    koşu     300
5  levent   yüzme     200
6   atlas    koşu     250
7   fatma  basket     400